app/Controllers/DashboardController.php

 public function verificationConnexion()
    {
        $email = $this->request->getPost('email');
        $mdp = $this->request->getPost('mdp');

        $userModel = new UserModel();

        $userClient = $userModel
                    ->where('email', $email)
                    ->where('password', $mdp)
                    ->where('role', 'client')
                    ->first();

        $userAdmin = $userModel
                    ->where('email', $email)
                    ->where('password', $mdp)
                    ->where('role', 'admin')
                    ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'randriamihajahonore1@gmail.com'
AND `password` = '12345678'
AND `role` = 'client'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'randriamihajahonore1@gmail.com'
AND `password` = '12345678'
AND `role` = 'admin'
 LIMIT 1